Repository: SilverAssist/silver-assist-security
Catalog: languages/silver-assist-security-*.po
Languages: es_es

source: Resolves critical security vulnerabilities: WordPress login protection, HTTPOnly cookie implementation, and comprehensive GraphQL security. Addresses security audit findings automatically.
es_es: Resuelve vulnerabilidades de seguridad críticas: protección de inicio de sesión de WordPress, implementación de cookies HTTPOnly y seguridad integral de GraphQL. Aborda automáticamente los hallazgos de auditoría de seguridad.Resuelve vulnerabilidades críticas de seguridad: protección de login de WordPress, implementación de cookies HTTPOnly y seguridad integral de GraphQL. Soluciona automáticamente hallazgos de auditorías de seguridad.

source: Security
es_es: Seguridad de Login

source: Security configuration for WordPress
es_es: Configuración de Seguridad

source: Check Updates
es_es: Verificar Actualizaciones

source: Security Essentials
es_es: Seguridad Esencial

source: Update available! Redirecting to Updates page...
es_es: ¡Actualización disponible! Redirigiendo a la página de actualizaciones...

source: You're up to date!
es_es: Actualizado

source: Error checking updates. Please try again.
es_es: Error al verificar actualizaciones:

source: Error connecting to update server.
es_es: Error al verificar actualizaciones:

source: Security validation failed
es_es: Verificación de seguridad falló.

source: Insufficient permissions
es_es: Permisos insuficientes

source: Updater not available
es_es: ¡Actualización Disponible!

source: Update available!
es_es: ¡Actualización Disponible!

source: Error checking for updates
es_es: Error al verificar actualizaciones:

source: Reason
es_es: Razón

source: Blocked
es_es: IPs Bloqueadas

source: Violations
es_es: Violaciones

source: Actions
es_es: Acciones

source: Unknown
es_es: Error desconocido

source: Form security violation
es_es: Configuración de Seguridad

source: Unblock
es_es: Desbloquear

source: No CF7 blocked IPs found.
es_es: No se encontraron IPs bloqueadas de CF7.

source: Failed to retrieve blocked IPs
es_es: Error al obtener las IPs bloqueadas

source: Invalid IP address
es_es: Dirección IP inválida

source: Manually blocked via admin panel
es_es: Bloqueado manualmente desde el panel de administración

source: IP %s successfully blocked for CF7 forms
es_es: IP %s bloqueada exitosamente para formularios CF7

source: Failed to block IP address
es_es: Error al cargar estadísticas de login

source: IP address required
es_es: Se requiere dirección IP

source: IP %s successfully unblocked
es_es: IP %s desbloqueada exitosamente

source: Failed to unblock IP address
es_es: Error al desbloquear la dirección IP

source: Successfully cleared %d CF7 blocked IPs
es_es: Se limpiaron exitosamente %d IPs bloqueadas de CF7

source: Failed to clear blocked IPs
es_es: Error al cargar estadísticas de login

source: Failed to export blocked IPs
es_es: Error al exportar las IPs bloqueadas

source: Failed to retrieve security status
es_es: Error al cargar elementos de seguridad

source: Failed to retrieve login statistics
es_es: Error al cargar estadísticas de login

source: Failed to retrieve security logs
es_es: Error al cargar elementos de seguridad

source: %d settings auto-saved successfully
es_es: %d configuraciones guardadas automáticamente con éxito

source: Failed to save settings
es_es: Error al cargar estadísticas de login

source: Admin path is required
es_es: Se requiere la ruta de administración

source: Admin path is valid
es_es: La ruta es válida

source: Failed to validate admin path
es_es: Error al cargar estadísticas de login

source: IP address is required
es_es: Se requiere la dirección IP

source: Invalid IP address format
es_es: Formato de dirección IP inválido

source: Manually blocked by administrator
es_es: Bloqueado manualmente por el administrador

source: IP address %s has been successfully blocked
es_es: La dirección IP %s ha sido bloqueada exitosamente

source: IP address %s has been unblocked
es_es: La dirección IP %s ha sido desbloqueada

source: IP address was not found in the blacklist
es_es: La dirección IP no se encontró en la lista negra

source: Loading...
es_es: Cargando...

source: Error loading data
es_es: Error al cargar datos

source: Last updated:
es_es: Última actualización:

source: No active threats detected
es_es: No se detectaron amenazas activas

source: Refreshing...
es_es: Actualizando...

source: New version %s available.
es_es: Nueva versión %s disponible.

source: Update now
es_es: Actualizar ahora

source: Checking...
es_es: Verificando...

source: New version available: %1$s\nCurrent version: %2$s
es_es: Nueva versión disponible: %1$s\nVersión actual: %2$s

source: The plugin is up to date with the latest version (%s)
es_es: El plugin está actualizado a la última versión (%s)

source: Error checking for updates:
es_es: Error al verificar actualizaciones:

source: Unknown error
es_es: Error desconocido

source: Connectivity error while checking for updates
es_es: Error de conectividad al verificar actualizaciones

source: Login attempts must be between 1 and 20
es_es: Los intentos de login deben estar entre 1 y 20

source: Lockout duration must be between 60 and 3600 seconds
es_es: La duración del bloqueo debe estar entre 60 y 3600 segundos

source: Session timeout must be between 5 and 120 minutes
es_es: El timeout de sesión debe estar entre 5 y 120 minutos

source: GraphQL query depth must be between 1 and 20
es_es: La profundidad de consulta GraphQL debe estar entre 1 y 20

source: GraphQL query complexity must be between 10 and 1000
es_es: La complejidad de consulta GraphQL debe estar entre 10 y 1000

source: GraphQL query timeout must be between 1 and %d seconds (PHP limit)
es_es: El timeout de consulta GraphQL debe estar entre 1 y %d segundos (límite PHP)

source: Custom admin URL must contain only lowercase letters, numbers, and hyphens (3-30 characters)
es_es: La URL personalizada de administración debe contener solo letras minúsculas, números y guiones (3-30 caracteres)La URL de admin personalizada debe contener solo letras minúsculas, números y guiones (3-30 caracteres)

source: Use only lowercase letters, numbers, and hyphens (3-30 characters)
es_es: Use solo letras minúsculas, números y guiones (3-30 caracteres)

source: Validating...
es_es: Validando...

source: ✓ Path is valid
es_es: ✓ Ruta válida

source: Path must be at least 3 characters long
es_es: La ruta debe tener al menos 3 caracteres

source: Path must be 50 characters or less
es_es: La ruta debe tener 50 caracteres o menos

source: This path contains forbidden keywords
es_es: Esta ruta contiene palabras clave prohibidas

source: Path can only contain letters, numbers, hyphens, and underscores
es_es: La ruta solo puede contener letras, números, guiones y guiones bajos

source: Path cannot be empty
es_es: La ruta no puede estar vacía

source: Saving...
es_es: Guardando...

source: Saved!
es_es: ¡Guardado!

source: Save failed
es_es: Error al guardar

source: Failed to check for Silver Assist updates
es_es: Error al verificar actualizaciones de Silver Assist

source: Failed to load security essentials
es_es: Error al cargar elementos de seguridad

source: Failed to load login stats
es_es: Error al cargar estadísticas de login

source: IP Hash
es_es: Hash IP

source: Blocked Time
es_es: Tiempo Bloqueado

source: Remaining
es_es: Restante

source: Enabled
es_es: Habilitado

source: Disabled
es_es: Deshabilitado

source: Headless CMS
es_es: CMS sin Cabeza

source: Standard
es_es: Estándar

source: Found %d recent security events
es_es: Se encontraron %d eventos de seguridad recientes

source: Unable to retrieve security logs
es_es: No se pudieron obtener los registros de seguridad

source: You do not have sufficient permissions to access this page.
es_es: No tiene permisos suficientes para acceder a esta página.

source: Permission Denied
es_es: Permiso Denegado

source: Security Dashboard
es_es: Panel de Estado de Seguridad

source: Login Protection
es_es: Protección contra Bots

source: GraphQL Security
es_es: Seguridad GraphQL

source: Form Protection
es_es: Protección contra Bots

source: IP Management
es_es: Gestión de IP

source: Login Security
es_es: Seguridad de Login

source: Max Attempts
es_es: Intentos Máx.

source: Blocked IPs
es_es: IPs Bloqueadas

source: Lockout (min)
es_es: Bloqueo (min)

source: Admin Security
es_es: Seguridad de Administración

source: Password Strength Enforcement
es_es: Aplicación de Fortaleza de Contraseña

source: Bot Protection
es_es: Protección contra Bots

source: Session Timeout (min)
es_es: Timeout de Sesión (minutos)

source: Max Depth
es_es: Profundidad Máx.

source: Max Complexity
es_es: Complejidad Máx.

source: Introspection
es_es: Introspección

source: Public
es_es: Público

source: General Security
es_es: Seguridad General

source: HTTPOnly Cookies
es_es: Cookies HTTPOnly

source: XML-RPC Protection
es_es: Protección XML-RPC

source: Version Hiding
es_es: Ocultación de Versión

source: Under Attack Mode
es_es: Modo Bajo Ataque

source: Active
es_es: Activo

source: Inactive
es_es: Inactivo

source: IP Blacklisting
es_es: Lista Negra de IP

source: active
es_es: activo

source: inactive
es_es: inactivo

source: Rate Limit (min)
es_es: Limitación de Velocidad Mejorada

source: Security Statistics
es_es: Seguridad Esencial

source: Failed Login Attempts (24h)
es_es: Intentos Máximos de Login

source: Security Events (7d)
es_es: Seguridad Esencial

source: Recent Security Activity
es_es: Actividad de Seguridad Reciente

source: Security Logs
es_es: Configuración de Seguridad

source: Loading blocked IPs...
es_es: Cargando IPs bloqueadas...

source: Loading security logs...
es_es: Configuración de Seguridad de Login

source: Login Protection Settings
es_es: Configuración de Seguridad de Login

source: Failed Login Attempts
es_es: Intentos Máximos de Login

source: Number of failed login attempts before IP lockout (1-20)
es_es: Número de intentos de login fallidos antes del bloqueo (1-20)

source: Lockout Duration (minutes)
es_es: Duración del Bloqueo (segundos)

source: Duration to block IP after failed attempts (1-60 minutes)
es_es: Duración del bloqueo de IP tras intentos fallidos (1-60 minutos)Cuánto tiempo bloquear usuarios después de intentos fallidos (60-3600 segundos)

source: Session Timeout (minutes)
es_es: Timeout de Sesión (minutos)

source: Automatic logout after inactivity (5-120 minutes)
es_es: Cierre de sesión automático por inactividad (5-120 minutos)

source: Require strong passwords (12+ chars, mixed case, numbers, symbols)
es_es: Requerir contraseñas seguras (12+ caracteres, mayúsculas, minúsculas, números, símbolos)

source: Block known bots, crawlers, and security scanners
es_es: Bloquear bots conocidos, rastreadores y escáneres de seguridadDetecta y bloquea bots comunes, rastreadores y herramientas de escaneo de seguridad.

source: Save Login Settings
es_es: Guardar Configuración de Seguridad

source: Admin Hide Security
es_es: Seguridad de Ocultación de Admin

source: Hide WordPress admin and login pages from unauthorized users by redirecting to custom URLs.
es_es: Ocultar las páginas de administración e inicio de sesión de WordPress de usuarios no autorizados redirigiendo a URLs personalizadas.Oculta las páginas de administración y login de WordPress de usuarios no autorizados redirigiendo a URLs personalizadas.

source: Enable Admin Hiding
es_es: Habilitar Ocultación de Admin

source: Hide /wp-admin and /wp-login.php from unauthorized users
es_es: Ocultar /wp-admin y /wp-login.php de usuarios no autorizados

source: When enabled, direct access to WordPress admin URLs will return 404 errors. Use the custom path below to access the admin area.
es_es: Cuando está habilitado, el acceso directo a las URLs de administración de WordPress devolverá errores 404. Use la ruta personalizada a continuación para acceder al área de administración.Cuando está habilitado, el acceso directo a URLs de administración de WordPress devolverá errores 404. Usa la ruta personalizada abajo para acceder al área de administración.

source: Custom Admin Path
es_es: Ruta de Admin Personalizada

source: Custom path to access the admin area (e.g., 'my-secret-admin'). Avoid common words like 'admin', 'login', etc.
es_es: Ruta personalizada para acceder al área de administración (ej., 'mi-admin-secreto'). Evite palabras comunes como 'admin', 'login', etc.Ruta personalizada para acceder al área de administración (ej: 'mi-admin-secreto'). Evita palabras comunes como 'admin', 'login', etc.

source: Important Security Notice
es_es: Aviso de Seguridad Importante

source: Save your custom admin URL in a secure location before enabling this feature.
es_es: Guarde su URL de administración personalizada en un lugar seguro antes de habilitar esta función.Guarda tu URL de admin personalizada en un lugar seguro antes de habilitar esta característica.

source: If you forget the custom path, you can disable this feature via FTP by adding this line to wp-config.php:
es_es: Si olvida la ruta personalizada, puede desactivar esta función vía FTP agregando esta línea a wp-config.php:Si olvidas la ruta personalizada, puedes desactivar esta función via FTP agregando esta línea a wp-config.php:

source: This feature adds an extra layer of security but should be used alongside strong passwords and other security measures.
es_es: Esta función agrega una capa adicional de seguridad pero debe usarse junto con contraseñas seguras y otras medidas de seguridad.Esta característica agrega una capa extra de seguridad pero debe usarse junto con contraseñas fuertes y otras medidas de seguridad.

source: Save Admin Hide Settings
es_es: Habilitar Ocultación de Admin

source: GraphQL Security Settings
es_es: Guardar Configuración de Seguridad

source: Headless CMS Mode
es_es: Modo CMS sin Cabeza

source: Enable higher limits for headless WordPress configurations
es_es: Habilitar límites más altos para configuraciones headless de WordPress

source: Query Timeout (seconds)
es_es: Timeout de consulta: Límites estándar

source: Maximum execution time for GraphQL queries (1-30 seconds)
es_es: Tiempo máximo de ejecución para consultas GraphQL (1-30 segundos)

source: Save GraphQL Settings
es_es: Abrir Configuración de WPGraphQL

source: WPGraphQL Plugin Not Detected
es_es: Plugin WPGraphQL no detectado

source: GraphQL security features require the WPGraphQL plugin to be installed and activated.
es_es: Las funciones de seguridad de GraphQL requieren que el plugin WPGraphQL esté instalado y activado.

source: Install WPGraphQL Plugin
es_es: Instalar el Plugin WPGraphQL

source: Contact Form 7 Protection
es_es: Protección contra Bots

source: Enable protection for Contact Form 7 submissions
es_es: Habilitar protección para envíos de Contact Form 7

source: Rate Limit (submissions/minute)
es_es: Límite de Peticiones (envíos/minuto)

source: Maximum form submissions per minute per IP address
es_es: Máximo de envíos de formulario por minuto por dirección IP

source: Save Form Settings
es_es: Guardar Configuración de Seguridad

source: Blocked IPs Management
es_es: IPs Bloqueadas

source: IP Management & Attack Protection
es_es: Gestión de IP y Protección contra Ataques

source: IP Blacklist
es_es: Lista Negra de IP

source: Enable automatic IP blacklisting for repeat offenders
es_es: Habilitar lista negra automática de IP para infractores reincidentes

source: Enable enhanced protection during active attacks
es_es: Habilitar protección mejorada durante ataques activos

source: Save IP Settings
es_es: Guardar Configuración de Seguridad

source: Login Security - Blocked IPs
es_es: Configuración de Seguridad de Login

source: Form Protection - Blocked IPs
es_es: Protección de Formularios - IPs Bloqueadas

source: Loading CF7 blocked IPs...
es_es: Cargando IPs bloqueadas...

source: Manual IP Management
es_es: Gestión Manual de IP

source: Enter IP address (e.g., 192.168.1.100)
es_es: Ingrese dirección IP (ej., 192.168.1.100)

source: Reason for blocking
es_es: Razón del bloqueo

source: Block IP
es_es: IPs Bloqueadas

source: Manually block specific IP addresses. Blocked IPs will be denied access to login and forms.
es_es: Bloquear manualmente direcciones IP específicas. Las IPs bloqueadas no podrán acceder al inicio de sesión ni a los formularios.

source: Security check failed.
es_es: Verificación de seguridad falló.

source: Security settings have been saved successfully.
es_es: La configuración de seguridad se ha guardado exitosamente.

source: Path cannot contain "%s" for security reasons
es_es: La ruta no puede contener "%s" por razones de seguridad

source: Settings
es_es: Configuración

source: %d seconds
es_es: %d segundos

source: %d minutes
es_es: %d minutos

source: %d hours
es_es: %d horas

source: Contact Form 7 plugin is not active
es_es: El plugin Contact Form 7 no está activo

source: Contact Form 7 v%s is active and compatible
es_es: Contact Form 7 v%s está activo y es compatible

source: Contact Form 7 v%s detected but requires v5.0 or higher
es_es: Contact Form 7 v%s detectado pero requiere v5.0 o superior

source: Public introspection enabled (security risk)
es_es: Introspección pública habilitada (riesgo de seguridad)

source: Debug mode enabled (not recommended for production)
es_es: Modo debug habilitado (no recomendado para producción)

source: GraphQL endpoint is publicly accessible
es_es: El endpoint GraphQL es accesible públicamente

source: WPGraphQL not active
es_es: WPGraphQL no activo

source: RESTRICTED
es_es: RESTRINGIDO

source: PUBLIC
es_es: PÚBLICO

source: Endpoint Access
es_es: Acceso al Endpoint

source: Query Depth Limiting
es_es: Limitación de Profundidad de Consulta

source: Batch Queries
es_es: Consultas por Lotes

source: Limit
es_es: Límite

source: Public Introspection
es_es: Introspección Pública

source: Debug Mode
es_es: Modo Debug

source: ⚠️ Security Concerns:
es_es: ⚠️ Preocupaciones de Seguridad:

source: Query complexity %1$d exceeds maximum allowed complexity %2$d
es_es: La complejidad de la consulta %1$d excede la complejidad máxima permitida %2$dLa complejidad de consulta %1$d excede la complejidad máxima permitida %2$d

source: Introspection is disabled in production.
es_es: ✓ Deshabilitar Introspección Pública en producción

source: Query contains too many aliases (%1$d). Maximum allowed: %2$d
es_es: La consulta contiene demasiados alias (%1$d). Máximo permitido: %2$d

source: Query contains too many directives (%1$d). Maximum allowed: %2$d
es_es: La consulta contiene demasiadas directivas (%1$d). Máximo permitido: %2$d

source: Query contains excessive field duplication. Maximum allowed: %d
es_es: La consulta contiene duplicación excesiva de campos. Máximo permitido: %d

source: Query depth exceeds maximum limit of %d levels.
es_es: La profundidad de la consulta excede el límite máximo de %d niveles.

source: Query is too large (%1$d characters). Maximum allowed: %2$d characters.
es_es: La consulta es demasiado grande (%1$d caracteres). Máximo permitido: %2$d caracteres.La consulta es demasiado grande (%1$d caracteres). Máximo permitido: %2$d caracteres.

source: Query execution timeout exceeded (%ds limit)
es_es: Tiempo de ejecución de consulta excedido (límite %ds)

source: Rate limit exceeded. Please try again later.
es_es: Límite de velocidad excedido. Intente nuevamente más tarde.

source: Query depth %1$d exceeds maximum allowed depth %2$d
es_es: La profundidad de consulta %1$d excede la profundidad máxima permitida %2$dLa complejidad de consulta %1$d excede la complejidad máxima permitida %2$d

source: Query contains %1$d aliases, maximum %2$d allowed
es_es: La consulta contiene demasiados alias (%1$d). Máximo permitido: %2$d

source: Query contains %1$d directives, maximum %2$d allowed
es_es: La consulta contiene %1$d directivas, máximo %2$d permitidasLa consulta contiene demasiadas directivas (%1$d). Máximo permitido: %2$d

source: Query contains %1$d field duplicates, maximum %2$d allowed
es_es: La consulta contiene %1$d campos duplicados, máximo %2$d permitidosLa consulta contiene duplicación excesiva de campos. Máximo permitido: %d

source: Security validation failed. Please try again.
es_es: Límite de velocidad excedido. Intente nuevamente más tarde.

source: Invalid login credentials.
es_es: Credenciales de acceso inválidas.

source: Secured by %s
es_es: Protegido por %s

source: Password must be at least 8 characters long and contain uppercase, lowercase, numbers, and special characters.
es_es: La contraseña debe tener al menos 8 caracteres y contener mayúsculas, minúsculas, números y caracteres especiales.La contraseña debe tener al menos 8 caracteres e incluir mayúsculas, minúsculas, números y caracteres especiales.

source: Password meets security requirements
es_es: La contraseña cumple los requisitos de seguridad

source: Website URL (leave blank):
es_es: URL del sitio web (dejar en blanco):

source: Too many failed login attempts. Try again in %d minutes.
es_es: Demasiados intentos de inicio de sesión fallidos. Inténtelo de nuevo en %d minutos.

source: <strong>Error:</strong> Please solve the security challenge.
es_es: <strong>Error:</strong> Por favor resuelva el desafío de seguridad.

source: <strong>Error:</strong> Incorrect answer to the security challenge. Please try again.
es_es: <strong>Error:</strong> Respuesta incorrecta al desafío de seguridad. Por favor inténtelo de nuevo.

source: Security Check
es_es: Verificación de seguridad falló.

source: Your answer
es_es: Su respuesta

source: Get a new question
es_es: Obtener una nueva pregunta
